lib/tasks/stripe.rake


    puts "Syncing plans in #{mode_label} mode..."

    Plan.active.where.not(slug: %w[free enterprise]).find_each do |plan|
---
SELECT "plans".* FROM "plans" WHERE "plans"."active" = ? AND "plans"."slug" NOT IN (?, ?) ORDER BY "plans"."id" ASC LIMIT ?  [["active", 1], ["slug", "free"], ["slug", "enterprise"], ["LIMIT", 1000]]