app/controllers/api/v1/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "newuser@test.com"], ["LIMIT", 1]]
---
      def sign_in
        user = User.find_for_database_authentication(email: params[:email])

INSERT INTO "users" ("email", "encrypted_password", "name", "business_name", "plan", "admin", "suspended", "provider", "uid", "created_at", "updated_at", "reset_password_token", "reset_password_sent_at", "remember_created_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
      def sign_up
        user = User.new(user_params)
        user.password = params[:password]
        user.confirmed_at = Time.current unless AdminSetting.instance.enable_email_verification
        if user.save