app/controllers/api/v1/base_controller.rb

      def resolve_user_from_param(param)
        return nil if param.blank?

        decoded_id = UserIdObfuscator.decode(param)
        if decoded_id
          User.find_by(id: decoded_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]