app/controllers/api/v1/feedback_controller.rb

      def create
        authorize! :create, FeedbackSubmission
        location = Location.find_by(id: params[:location_id]) || Location.find_by(slug: params[:location_id])
        return render json: { error: "Location not found" }, status: :not_found unless location
        submission = location.feedback_submissions.build(feedback_params)
        enrich_with_device_and_location!(submission)
        if submission.save
          owner = submission.location.user
          if AdminSetting.instance.notify_on_new_feedback && owner.email_notifications_enabled? && submission.rating <= 3
            FeedbackMailer.new_feedback(submission).deliver_later
            Rails.logger.info "[Feedback] Sent new_feedback email to #{owner.email}"
          end
          if submission.contact_me && submission.customer_email.present?
---
SELECT "admin_settings".* FROM "admin_settings" ORDER BY "admin_settings"."id" ASC LIMIT ?  [["LIMIT", 1]]