app/controllers/api/v1/feedback_controller.rb

      def index
        authorize! :read, FeedbackSubmission
        submissions = FeedbackSubmission.joins(:location).where(locations: { user_id: current_user.id }).order(created_at: :desc)
        render json: { feedback: submissions.map { |f| feedback_json(f) } }, status: :ok
---
SELECT "feedback_submissions".* FROM "feedback_submissions" INNER JOIN "locations" ON "locations"."id" = "feedback_submissions"."location_id" WHERE "locations"."user_id" = ? ORDER BY "feedback_submissions"."created_at" DESC  [["user_id", 2]]

      def create
        authorize! :create, FeedbackSubmission
        location = Location.find_by(id: params[:location_id]) || Location.find_by(slug: params[:location_id])
        return render json: { error: "Location not found" }, status: :not_found unless location
        submission = location.feedback_submissions.build(feedback_params)
        if submission.save
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "feedback_submissions" ("location_id", "rating", "comment", "customer_name", "customer_email", "phone_number", "contact_me", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"