app/controllers/api/v1/locations_controller.rb

      def index
        authorize! :read, Location
        locations = current_user.locations
        render json: { locations: locations.map { |l| location_json(l) } }, status: :ok
---
SELECT "locations".* FROM "locations" WHERE "locations"."user_id" = ?  [["user_id", 2]]

      def create
        authorize! :create, Location
        plan = Plan.find_by(slug: current_user.plan)
        limit = plan&.location_limit
        if limit.present? && current_user.locations.count >= limit
          return render json: { error: "Location limit reached for your plan. Please upgrade to add more locations." }, status: :forbidden
        end
        location = current_user.locations.build(location_params.except(:logo))
        if location.save
---
INSERT INTO "locations" ("user_id", "name", "slug", "review_platforms", "logo_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

      def set_location
        @location = current_user.locations.find(params[:id])
---
SELECT "locations".* FROM "locations" WHERE "locations"."user_id" = ? AND "locations"."id" = ? LIMIT ?  [["user_id", 3], ["id", 1], ["LIMIT", 1]]